server/app/controllers/v1/snacks_controller.rb

  def index
    render json: Snack.all # return all snacks from db.
  end
---
SELECT "snacks".* FROM "snacks"

  def create
    # check model is valid before testing.
    # snack = Snack.new(name: params[:name], description: params[:description], rating: params[:rating])
    snack = Snack.new(snack_params)
    if snack.save #if true
---
INSERT INTO "snacks" ("name", "description", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Grape"], ["description", "Like a grapefruit.. but not"], ["rating", 7], ["created_at", "2021-04-07 11:47:08.261916"], ["updated_at", "2021-04-07 11:47:08.261916"]]