server/app/controllers/api/v1/snacks_controller.rb

  def index
    render json: Snack.all # return all snacks from db.
  end
---
SELECT "snacks".* FROM "snacks"

  def create
    # check model is valid before testing.
    # snack = Snack.new(name: params[:name], description: params[:description], rating: params[:rating])
    snack = Snack.new(snack_params)
    if snack.save #if true
---
INSERT INTO "snacks" ("name", "description", "rating", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Test"], ["description", "test desc"], ["rating", 1], ["created_at", "2021-04-08 07:43:17.306642"], ["updated_at", "2021-04-08 07:43:17.306642"]]

  def show
    render json: Snack.find(params[:id])
---
SELECT "snacks".* FROM "snacks" WHERE "snacks"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]

  def update
    snack = Snack.find(params[:id])
    snack.update(snack_params)
---
SELECT "snacks".* FROM "snacks" WHERE "snacks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "snacks" SET "name" = $1, "description" = $2, "rating" = $3, "updated_at" = $4 WHERE "snacks"."id" = $5  [["name", "Mars Bar"], ["description", "Not as good as Snickers"], ["rating", 7], ["updated_at", "2021-04-07 12:53:04.990938"], ["id", 7]]

  def destroy
    Snack.find(params[:id]).destroy! # destroy bang gives more callback options.

---
DELETE FROM "snacks" WHERE "snacks"."id" = $1  [["id", 5]]
SELECT "snacks".* FROM "snacks" WHERE "snacks"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]